In [209]:
import pandas as pd

In [210]:
# PANDAS Series
s = pd.Series(
    [10,20,30,40,50],
    index=[1,2,3,4,5]
)

print('Pandas Series')
print(s)
print('Accesing Single Column',s[5])

Pandas Series
1    10
2    20
3    30
4    40
5    50
dtype: int64
Accesing Single Column 50

In [211]:
type(s)

pandas.core.series.Series

In [212]:
# Creating a DataFrame
data = {
    'Name' : ['Tejas', 'Nikhil','Shubham'],
    'Skills' : ['AIML','Python','Data Science'],
    'Package(lpa)' : [20,50,80]
}

In [213]:
df = pd.DataFrame(data)

In [214]:
type(df)

pandas.core.frame.DataFrame

In [215]:
df['Package(lpa)']

0    20
1    50
2    80
Name: Package(lpa), dtype: int64

In [216]:
# Accesing Multiple Columns
df[['Name','Skills']]

      Name        Skills
0    Tejas          AIML
1   Nikhil        Python
2  Shubham  Data Science

In [217]:
# Indexing
df.iloc[0]

Name            Tejas
Skills           AIML
Package(lpa)       20
Name: 0, dtype: object

In [218]:
df.iloc[1:3]

      Name        Skills  Package(lpa)
1   Nikhil        Python            50
2  Shubham  Data Science            80

In [219]:
# Filtered Location
df.loc[df['Package(lpa)']<25]

    Name Skills  Package(lpa)
0  Tejas   AIML            20

In [220]:
# Reading Dataset
df = pd.read_csv('cardekho_imputated.csv')

In [221]:
# Top 5 Records
df.head()

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000

In [222]:
# Bottom 5 Records
df.tail()

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
15406,19537,Hyundai i10,Hyundai,i10,9,10723,Dealer,Petrol,Manual,19.81,1086,68.05,5,250000
15407,19540,Maruti Ertiga,Maruti,Ertiga,2,18000,Dealer,Petrol,Manual,17.50,1373,91.10,7,925000
15408,19541,Skoda Rapid,Skoda,Rapid,6,67000,Dealer,Diesel,Manual,21.14,1498,103.52,5,425000
15409,19542,Mahindra XUV500,Mahindra,XUV500,5,3800000,Dealer,Diesel,Manual,16.00,2179,140.00,7,1225000
15410,19543,Honda City,Honda,City,2,13000,Dealer,Petrol,Automatic,18.00,1497,117.60,5,1200000

In [223]:
# Total Rows and Columns
df.shape

(15411, 14)

In [224]:
# Dataset Info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15411 entries, 0 to 15410
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         15411 non-null  int64
 1   car_name           15411 non-null  object
 2   brand              15411 non-null  object
 3   model              15411 non-null  object
 4   vehicle_age        15411 non-null  int64
 5   km_driven          15411 non-null  int64
 6   seller_type        15411 non-null  object
 7   fuel_type          15411 non-null  object
 8   transmission_type  15411 non-null  object
 9   mileage            15411 non-null  float64
 10  engine             15411 non-null  int64
 11  max_power          15411 non-null  float64
 12  seats              15411 non-null  int64
 13  selling_price      15411 non-null  int64
dtypes: float64(2), int64(6), object(6)
memory usage: 1.6+ MB

In [225]:
# Statistical Summary
df.describe()

,Unnamed: 0,vehicle_age,km_driven,mileage,engine,max_power,seats,selling_price
count,15411.000000,15411.000000,1.541100e+04,15411.000000,15411.000000,15411.000000,15411.000000,1.541100e+04
mean,9811.857699,6.036338,5.561648e+04,19.701151,1486.057751,100.588254,5.325482,7.749711e+05
std,5643.418542,3.013291,5.161855e+04,4.171265,521.106696,42.972979,0.807628,8.941284e+05
min,0.000000,0.000000,1.000000e+02,4.000000,793.000000,38.400000,0.000000,4.000000e+04
25%,4906.500000,4.000000,3.000000e+04,17.000000,1197.000000,74.000000,5.000000,3.850000e+05
50%,9872.000000,6.000000,5.000000e+04,19.670000,1248.000000,88.500000,5.000000,5.560000e+05
75%,14668.500000,8.000000,7.000000e+04,22.700000,1582.000000,117.300000,5.000000,8.250000e+05
max,19543.000000,29.000000,3.800000e+06,33.540000,6592.000000,626.000000,9.000000,3.950000e+07

In [226]:
# Columns
df.columns

Index(['Unnamed: 0', 'car_name', 'brand', 'model', 'vehicle_age', 'km_driven',
       'seller_type', 'fuel_type', 'transmission_type', 'mileage', 'engine',
       'max_power', 'seats', 'selling_price'],
      dtype='object')

In [227]:
# Mean
df['vehicle_age'].mean()

6.0363376808772955

In [228]:
# Median
df['km_driven'].median()

50000.0

In [229]:
# Mode
df['vehicle_age'].mode()

0    4
Name: vehicle_age, dtype: int64

In [230]:
# Maximum Value
df['km_driven'].max()

3800000

In [231]:
# Minimum Value
df['vehicle_age'].min()

0

In [232]:
# Addition of all column values
df['selling_price'].sum()

11943079875

In [233]:
# Deleting Column
df.drop('Unnamed: 0',axis=1,inplace=True)

In [234]:
df['vehicle_age'].isnull().sum()

0

In [235]:
df.index

RangeIndex(start=0, stop=15411, step=1)

In [236]:
# Total Values according to Brand
df['brand'].value_counts()

brand
Maruti           4992
Hyundai          2982
Honda            1485
Mahindra         1011
Toyota            793
Ford              790
Volkswagen        620
Renault           536
BMW               439
Tata              430
Mercedes-Benz     337
Skoda             334
Audi              192
Datsun            170
Jaguar             59
Land Rover         51
Jeep               41
Kia                32
Porsche            21
Volvo              20
MG                 19
Mini               17
Nissan             11
Lexus              10
Isuzu               8
Bentley             3
Maserati            2
ISUZU               2
Ferrari             1
Mercedes-AMG        1
Rolls-Royce         1
Force               1
Name: count, dtype: int64

In [237]:
df.isnull().sum()

car_name             0
brand                0
model                0
vehicle_age          0
km_driven            0
seller_type          0
fuel_type            0
transmission_type    0
mileage              0
engine               0
max_power            0
seats                0
selling_price        0
dtype: int64

In [ ]:
# Fill all null values with mean
df.fillna(df.mean(numeric_only=True),axis=1)

In [238]:
# Drop all null values
df.dropna(inplace=True,axis=1)